УправлениеВетеринарнойКлиникой/src/InformationRegisters/ЦеныНаТовары/ЦеныНаТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНаТовары</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Товары</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УправлениеВетеринарнойКлиникой/src/InformationRegisters/ЦеныНаУслуги/ЦеныНаУслуги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНаУслуги</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Услуга</name>
    <type>
      <types>CatalogRef.Услуги</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УправлениеВетеринарнойКлиникой/src/CommonModules/РаботаСЦенамиВызовСервера/Module.bsl
#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьЦенуТовара(Товар) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЦеныНаТоварыСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныНаТовары.СрезПоследних КАК ЦеныНаТоварыСрезПоследних
		|ГДЕ
		|	ЦеныНаТоварыСрезПоследних.Товар = &Товар";
	
	Запрос.УстановитьПараметр("Товар", Товар);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Цена;
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Цена для товара не найдена!";
		Сообщение.Сообщить();
		Возврат 0;
	КонецЕсли;
КонецФункции

Функция ПолучитьЦенуУслуги(Услуга) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЦеныНаУслугиСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныНаУслуги.СрезПоследних КАК ЦеныНаУслугиСрезПоследних
		|ГДЕ
		|	ЦеныНаУслугиСрезПоследних.Услуга = &Услуга";
	
	Запрос.УстановитьПараметр("Услуга", Услуга);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Цена;
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Цена для услуги не найдена!";
		Сообщение.Сообщить();
		Возврат 0;
	КонецЕсли;
	
КонецФункции

#КонецОбласти
